In [39]:
import os
os.chdir("c:\\Users\\zhaobang\\OneDrive\\桌面\\NewKerosene")
import pandas as pd
from modules.kerosenePreprocess import Kerosene
import matplotlib.pyplot as plt
from modules import drawing as dr
from modules import DataDrop as DD
import numpy as np

In [40]:
df_cluster = pd.read_csv("./ClusterData/5_clusters.csv")
kerosene = Kerosene("./raw_data/2-supply-histories-with-sensor.csv")
# some special id to drop. Apporo dont need this
kerosene.normal_use.set_index("customer_id", inplace=True)
kerosene.normal_use.drop([666, 663, 650, 1086], inplace=True)
kerosene.normal_use.reset_index(inplace=True)
for i in range(kerosene.normal_use.shape[0]):
    if kerosene.normal_use.loc[i, "volume"] == 0:
        kerosene.normal_use.drop(i, inplace=True)
kerosene.normal_use.reset_index(inplace=True)

normal_use_drop = DD.supply_data_drop(kerosene.normal_use.copy())
normal_use_drop["supplied_at"] = pd.to_datetime(normal_use_drop["supplied_at"], format="%Y-%m-%d %X")

c:\Users\zhaobang\AppData\Local\Programs\Python\Python38\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [41]:
clustering_data = normal_use_drop.copy()

In [42]:
item_counts = df_cluster["Cluster"].value_counts()

In [43]:
item_counts.index

Int64Index([1, 2, 3, 5, 4], dtype='int64')

In [44]:
len(df_cluster)

121

In [45]:
cluster_df = {}
cluster_id = {}
for i in item_counts.index:
    cluster_df[i] = df_cluster[df_cluster["Cluster"] == i]
    cluster_id[i] = list(cluster_df[i]["ID"])

In [46]:
item_counts

1    70
2    45
3     4
5     1
4     1
Name: Cluster, dtype: int64

In [105]:
clustering_data.describe()

       customer_id       level_0         index  tank_type_id       volume
count  7212.000000   7212.000000   7212.000000   7212.000000  7212.000000
mean    833.666251   7399.707293  15640.857876      1.408209   242.069038
std     159.742368   4110.079077   8560.968209      0.877794   111.345315
min     601.000000     55.000000    430.000000      1.000000     9.100000
25%     715.000000   4061.750000   8279.750000      1.000000   168.275000
50%     808.000000   7401.500000  16287.500000      1.000000   219.450000
75%    1045.000000  11181.250000  23181.250000      1.000000   286.700000
max    1097.000000  13979.000000  28963.000000      6.000000  1173.300000

In [47]:

df_cluster_1 = clustering_data[clustering_data["customer_id"].isin(cluster_id[1])]
df_cluster_2 = clustering_data[clustering_data["customer_id"].isin(cluster_id[2])]
df_cluster_3 = clustering_data[clustering_data["customer_id"].isin(cluster_id[3])]
df_cluster_4 = clustering_data[clustering_data["customer_id"].isin(cluster_id[4])]
df_cluster_5 = clustering_data[clustering_data["customer_id"].isin(cluster_id[5])]
# df_cluster_1.describe()

In [65]:
plt.rcParams['figure.figsize'] = [10, 5]

In [66]:
cluster_id[1][:5]

[637, 615, 660, 620, 715]

In [97]:
df_cluster_1[df_cluster_1["customer_id"] == 637].describe()

       customer_id     level_0       index  tank_type_id      volume
count         69.0   69.000000   69.000000          69.0   69.000000
mean         637.0   93.376812  468.376812           1.0  232.323188
std            0.0   23.220238   23.220238           0.0   56.720245
min          637.0   55.000000  430.000000           1.0  101.700000
25%          637.0   72.000000  447.000000           1.0  188.300000
50%          637.0   94.000000  469.000000           1.0  244.800000
75%          637.0  114.000000  489.000000           1.0  273.500000
max          637.0  131.000000  506.000000           1.0  361.400000

In [61]:
cluster_id[2][:5]

[710, 718, 655, 653, 659]

In [100]:
df_cluster_2[df_cluster_2["customer_id"] == 655].describe()

       customer_id      level_0        index  tank_type_id      volume
count          7.0     7.000000     7.000000           7.0    7.000000
mean         655.0  2151.000000  4126.000000           1.0  150.557143
std            0.0     2.160247     2.160247           0.0   49.429811
min          655.0  2148.000000  4123.000000           1.0  104.300000
25%          655.0  2149.500000  4124.500000           1.0  118.450000
50%          655.0  2151.000000  4126.000000           1.0  133.100000
75%          655.0  2152.500000  4127.500000           1.0  169.450000
max          655.0  2154.000000  4129.000000           1.0  240.700000

In [62]:
cluster_id[3][:5]

[719, 750, 804, 869]

In [102]:
df_cluster_3[df_cluster_3["customer_id"] == 750].describe()

       customer_id      level_0         index  tank_type_id      volume
count         98.0    98.000000     98.000000          98.0   98.000000
mean         750.0  6697.326531  14763.326531           1.0  393.993878
std            0.0    34.503780     34.503780           0.0  125.746143
min          750.0  6639.000000  14705.000000           1.0  109.300000
25%          750.0  6667.250000  14733.250000           1.0  319.250000
50%          750.0  6695.500000  14761.500000           1.0  403.300000
75%          750.0  6724.750000  14790.750000           1.0  485.875000
max          750.0  6756.000000  14822.000000           1.0  818.200000

In [63]:
cluster_id[4][:5]

[1054]

In [103]:
df_cluster_4[df_cluster_4["customer_id"] == 1054].describe()

       customer_id      level_0         index  tank_type_id      volume
count        154.0   154.000000    154.000000         154.0  154.000000
mean        1054.0  9520.071429  19792.071429           3.0  465.589610
std            0.0    50.015175     50.015175           0.0  125.979771
min         1054.0  9435.000000  19707.000000           3.0   62.700000
25%         1054.0  9478.250000  19750.250000           3.0  387.675000
50%         1054.0  9519.500000  19791.500000           3.0  476.500000
75%         1054.0  9563.750000  19835.750000           3.0  542.000000
max         1054.0  9605.000000  19877.000000           3.0  827.400000

In [92]:
cluster_id[5][:5]

[1059]

In [104]:
df_cluster_5[df_cluster_5["customer_id"] == 1059].describe()

       customer_id      level_0         index  tank_type_id       volume
count         31.0    31.000000     31.000000          31.0    31.000000
mean        1059.0  7123.419355  15843.419355           1.0   747.838710
std            0.0    13.167572     13.167572           0.0   191.418816
min         1059.0  7103.000000  15823.000000           1.0   436.700000
25%         1059.0  7113.500000  15833.500000           1.0   603.750000
50%         1059.0  7125.000000  15845.000000           1.0   735.300000
75%         1059.0  7134.500000  15854.500000           1.0   832.450000
max         1059.0  7144.000000  15864.000000           1.0  1173.300000

In [106]:
df_cluster_1.head()

,customer_id,level_0,index,tank_type_id,supplied_at,volume,purpose
0,637,55,430,1,2016-11-07 06:53:00,302.7,NaN
1,637,56,431,1,2016-11-15 06:52:00,226.2,NaN
2,637,57,432,1,2016-11-21 05:38:00,187.3,NaN
3,637,58,433,1,2016-11-28 06:59:00,273.5,NaN
4,637,59,434,1,2016-12-05 07:07:00,222.0,NaN

In [107]:
def save_cluster(cluster, name):
    cluster.pop("level_0")
    cluster.pop("index")
    cluster.to_csv("./Hierarchical_data/" + name + ".csv", index=False)

In [108]:
save_cluster(df_cluster_1, "cluster_1")
save_cluster(df_cluster_2, "cluster_2")
save_cluster(df_cluster_3, "cluster_3")
save_cluster(df_cluster_4, "cluster_4")
save_cluster(df_cluster_5, "cluster_5")